In [3]:
import pandas as pd

data = {'Company':['GOOG','MSFT','ORCL','FB','GOOG','FB','ORCL'],
        'Person':['Sameer','Vikita','Tushar','Amy','Vipul','Vidhu','LarryEllison'],
        'Sales':[200,300,400,900,1000,3000,234]
       }

In [4]:
data

{'Company': ['GOOG', 'MSFT', 'ORCL', 'FB', 'GOOG', 'FB', 'ORCL'],
 'Person': ['Sameer',
  'Vikita',
  'Tushar',
  'Amy',
  'Vipul',
  'Vidhu',
  'LarryEllison'],
 'Sales': [200, 300, 400, 900, 1000, 3000, 234]}

In [5]:
df = pd.DataFrame(data)

In [7]:
df.head(7)

  Company        Person  Sales
0    GOOG        Sameer    200
1    MSFT        Vikita    300
2    ORCL        Tushar    400
3      FB           Amy    900
4    GOOG         Vipul   1000
5      FB         Vidhu   3000
6    ORCL  LarryEllison    234

In [9]:
compgroup = df.groupby('Company')

In [11]:
compgroup.sum()

         Sales
Company
FB        3900
GOOG      1200
MSFT       300
ORCL       634

In [12]:
compgroup.std()

               Sales
Company
FB       1484.924240
GOOG      565.685425
MSFT             NaN
ORCL      117.379726

In [17]:
compgroup.describe()

        Sales
        count    mean          std    min     25%     50%     75%     max
Company
FB        2.0  1950.0  1484.924240  900.0  1425.0  1950.0  2475.0  3000.0
GOOG      2.0   600.0   565.685425  200.0   400.0   600.0   800.0  1000.0
MSFT      1.0   300.0          NaN  300.0   300.0   300.0   300.0   300.0
ORCL      2.0   317.0   117.379726  234.0   275.5   317.0   358.5   400.0